Each rows-> series 
All rows together -> dataframe 
to install 
pip install pandas

In [1]:
import pandas as pd

In [2]:
cont1= ['USA','India','China']

In [3]:
type(cont1)

list

In [6]:
pd.Series(cont1)  #S is capital

0      usa
1    india
2    china
dtype: object

In [7]:
cont1

['usa', 'india', 'china']

In [8]:
import numpy as np

In [9]:
arr = np.random.randint(10,100,size=(6,4))

In [10]:
arr

array([[93, 45, 86, 84],
       [10, 12, 40, 75],
       [25, 33, 51, 82],
       [16, 47, 45, 14],
       [66, 66, 44, 37],
       [37, 30, 15, 20]])

In [19]:
df = pd.DataFrame(arr,dtype=int)
df

    0   1   2   3
0  93  45  86  84
1  10  12  40  75
2  25  33  51  82
3  16  47  45  14
4  66  66  44  37
5  37  30  15  20

In [17]:
#df= pd.DataFrame(arr,dtype=float,columns=["a","b","c","d"],index=["f","g","h","i","j","k"])
#df

      a     b     c     d
f  93.0  45.0  86.0  84.0
g  10.0  12.0  40.0  75.0
h  25.0  33.0  51.0  82.0
i  16.0  47.0  45.0  14.0
j  66.0  66.0  44.0  37.0
k  37.0  30.0  15.0  20.0

row wise same in numpy and pandas

In [21]:
df[::][[1,2,3]]  #columns reading

    1   2   3
0  45  86  84
1  12  40  75
2  33  51  82
3  47  45  14
4  66  44  37
5  30  15  20

In [23]:
type(df[1][1])

numpy.int64

In [22]:
type(df)

pandas.core.frame.DataFrame

In [38]:
df.columns=["a","b","c","d"]
df

    a   b   c   d
0  93  45  86  84
1  10  12  40  75
2  25  33  51  82
3  16  47  45  14
4  66  66  44  37
5  37  30  15  20

In [29]:
cols=["a","b"]
df[cols]

    a   b
0  93  45
1  10  12
2  25  33
3  16  47
4  66  66
5  37  30

In [30]:
df.columns[cols]=["A","B"]
df

TypeError: Index does not support mutable operations

In [34]:
type(df[0:0])

pandas.core.frame.DataFrame

In [31]:
type(df[0:2])

pandas.core.frame.DataFrame

In [41]:
df["a+b"] = df["a"] + df["b"]
df

    a   b   c   d  a+b
0  93  45  86  84  138
1  10  12  40  75   22
2  25  33  51  82   58
3  16  47  45  14   63
4  66  66  44  37  132
5  37  30  15  20   67

In [43]:
df.drop("a+b",axis=1,inplace=True)
df

    a   b   c   d
0  93  45  86  84
1  10  12  40  75
2  25  33  51  82
3  16  47  45  14
4  66  66  44  37
5  37  30  15  20

NaN - Not a number

In [45]:
df["a"]

0    93
1    10
2    25
3    16
4    66
5    37
Name: a, dtype: int64

In [55]:
df.iloc[0]  #iloc to get the specific row

a    93
b    45
c    86
d    84
Name: 0, dtype: int64

In [59]:
df.iloc[0:3,1:3]

    b   c
0  45  86
1  12  40
2  33  51

In [70]:
df[0:3]["a"]  #why not 2 ?

0    93
1    10
2    25
Name: a, dtype: int64

In [ ]:
#aggregated function -> group by

In [5]:
import pandas as pd

In [6]:
df = pd.read_csv("data.csv")
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [7]:
df.shape

(150, 5)

In [22]:
describe = df.describe()
describe

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

Memory usage: 6.0+ KB

In [14]:
df[df['species'] == "setosa"].shape

(50, 5)

In [15]:
df["species"].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

scikit , matplotlib, numpy ,

In [16]:
df["species"].apply(len)

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [18]:
df["species"].apply(lambda x: x+" "+ x)

0            setosa setosa
1            setosa setosa
2            setosa setosa
3            setosa setosa
4            setosa setosa
              ...
145    virginica virginica
146    virginica virginica
147    virginica virginica
148    virginica virginica
149    virginica virginica
Name: species, Length: 150, dtype: object

In [23]:
groupby = df.groupby("species")
groupby

In [24]:
groupby.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [26]:
df[df["species"] == "setosa"] ["sepal_length"].mean()

5.006

In [27]:
groupby.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.418         1.464        0.244
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [28]:
groupby.describe()

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.418  ...        1.575  1.9        50.0  0.244
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.107210  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

groupby object -> aggragate function

product -> we need to know attributes

50 problems 
30 days pandas 
101 exerc
hard/medium  - python 
regex